<?php
//=========================================================================上面是一部分，主要是用来后台来接收到客户端的消息。
//用类的方法进行封装接收从客户端发送过来的消息。
include 'contain.class.php';
include 'db.php';
//实例化对象
$post = new Input();

//向对象中进行传参。
$msg = $post->post("msg");
$user = $post->post("user");

if ($msg == ""){
    echo "用户信息不能为空";
    exit;
}
if ($user == ""){
    echo "用户名不能为空";
    exit;
}





//================================================================这一部分，主要是用来连接后台数据库，如果成功才能进行下面的操作。
//========================================================================当数据库连接成功后将客户端的数据写入到数据库中保存。

//取出现在的时间戳用来提示发表的时间。
$t = time();

//将客户端的信息读取写入到数据库中php105这张表里。
$sql = "INSERT INTO php105(`username`,`massage`,`infotime`) VALUES ('{$user}','{$msg}','{$t}')";
$is = $mysqli->query($sql);

//判断是否插入成功
if($is == true){
   header("Location:MyFile.php");
}else{
    echo "插入失败";
    exit;
}



































































































?>